% Фильтрация
%> @file Filtration.m
% =========================================================================
%> @brief Фильтрация
%> @param sign входной сигнал сигнал
%> @param coeff коэффиценты фильтра
%> @param nsamp число выборок на символ
%> @param UpSampFlag [1] -  фильтр с передискретизацией,[0] - фильтр без передискретизации 
%> @return filtsign отфильтрованный сигнал 
% =========================================================================
function filtsign = Filtration(sign, coeff, nsamp, UpSampFlag)
    %> @todo место для вашего кода
end 