% Генерация коэффицентов (импульсной характеристики) для фильтра 
% приподнятого косинуса
%> @file RCcoeff.m
% =========================================================================
%> @brief Генерация коэффицентов (импульсной характеристики)для фильтра 
%> приподнятого косинуса
%> @param span Длина фильтра в символах (количество боковых лепестков sinc, 
%> сумма с двух сторон)
%> @param nsamp Число выборок на символ
%> @param rolloff Коэффицент сглаживания (alfa)
%> @return coeff Коэффиценты для фильтра корень из приподнятого косинуса
% =========================================================================
function coeff = RCcoeff (span, nsamp, rolloff)
    %> @todo Место для вашего кода
    T=1;
    % Вектор времени    
    t1 = (-span/2):(1/nsamp):(span/2);
    coeff = zeros(1, numel(t1));

    % Расчет коэффициентов приподнятого косинуса
    for idx = 1:length(t1)
        time = t1(idx);
        
        switch time
            case {T/(2*rolloff), -T/(2*rolloff)}
                coeff(idx) = (pi / (4 * T)) * sinc(1 / (2 * rolloff));
            otherwise
                coeff(idx) = (1 / T) * sinc(time / T) * (cos(pi * rolloff * ...
                    time / T) / (1 - (2 * rolloff * time / T)^2));
        end
    end

    % Нормализация коэффициентов фильтра
    coeff = coeff / sqrt(sum(coeff.^2));
end