% Генерация коэффицентов (импульсной характеристики) для фильтра 
% приподнятого косинуса
%> @file RCcoeff.m
% =========================================================================
%> @brief Генерация коэффицентов (импульсной характеристики)для фильтра 
%> приподнятого косинуса
%> @param span Длина фильтра в символах (количество боковых лепестков sinc, 
%> сумма с двух сторон)
%> @param nsamp Число выборок на символ
%> @param rolloff Коэффицент сглаживания (alfa)
%> @return coeff Коэффиценты для фильтра корень из приподнятого косинуса
% =========================================================================
function coeff = RCcoeff (span, nsamp, rolloff)
    %> @todo Место для вашего кода
    
end